In [1]:
import pandas as pd

### Pandas Series

A **Series** in pandas is a one-dimensional array-like object that can hold various types of data, such as integers, floats, strings, etc.

Key Features:
- **Single column of data**: It represents a single column or a set of observations tied to a single variable, similar to a column in an Excel sheet.
- **Index and values**: A Series has an **index** (labels for each element) and a **single column of values**. The index helps uniquely identify the elements.
- **Flexibility**: You can create a Series from lists, numpy arrays, or other data structures.
- **Data consistency**: It's important to maintain consistency in the data type within a Series, meaning it should only contain one type of data (e.g., all integers or all strings).
- **Unique capabilities**: Series in pandas offer additional tools for handling data and managing operations on a sequence of values, making it more powerful than basic Python lists.

In [4]:
products = ['a','b','c','d']
type(products)

list

In [5]:
products_categories = pd.Series(products)
products_categories

0    a
1    b
2    c
3    d
dtype: object

the left column reference the <b>index values</b>
<br>also, we see the datatype is object, which is the default datatype assigned to data which is not <b>numeric

In [6]:
type(products_categories)

pandas.core.series.Series

In [9]:
daily_rates_dollars = pd.Series([40,45,50,60])
daily_rates_dollars

0    40
1    45
2    50
3    60
dtype: int64

In [12]:
import numpy as np 
array_a = np.array([10,20,30,40,50])
type(array_a)

numpy.ndarray

In [15]:
,series_a = pd.Series(array_a)
series_a

0    10
1    20
2    30
3    40
4    50
dtype: int32

### Working with Methods 

In Python, objects have **attributes** and **methods** associated with them, which define the data and behavior of the object.

#### Attributes vs Methods

- **Attributes (Passive)**: 
  - Attributes provide metadata or describe the state of an object. 
  - They are variables that store data about the object.
  - Attributes do not require parentheses when accessed.
  - Example: `.shape` (provides the dimensions of an object like a DataFrame).

- **Methods (Active)**:
  - Methods define the functionality and behavior of the object.
  - Methods are functions that perform actions on the object.
  - They require parentheses to be called, as they may take arguments and return results.
  - Methods are used to modify or manipulate the object.
  - Example: `.head()` (returns the first few rows of a DataFrame).

#### Methods vs Functions

- **Functions** are independent entities and can be called anywhere in the code.
- **Methods** are tied to an object and have access to the object's data. They can manipulate or modify the object's state, which is why they are specifically tied to a particular class or data structure.

#### Methods in Pandas

- Pandas leverages the computational abilities of **NumPy** to provide a set of **mathematical methods** that perform various operations on data.
- Additionally, pandas includes **non-mathematical methods** that are specific to pandas and allow operations tailored to data structures like Series and DataFrames (e.g., data manipulation, reshaping, and handling missing values).

In [4]:
start_dates_deposits = pd.Series({
    '7/4/2014' : 2000,
    '7/4/2015' : 2000,
    '7/4/2016' : 2200,
    '7/4/2017' : 4000,
    '7/4/2019' : 2000 })
start_dates_deposits

7/4/2014    2000
7/4/2015    2000
7/4/2016    2200
7/4/2017    4000
7/4/2019    2000
dtype: int64

the dictionary keys became the indices

In [5]:
start_dates_deposits.sum() #sum all deposits

12200

In [7]:
start_dates_deposits.min() #get the min value

2000

In [8]:
start_dates_deposits.max()

4000

In [9]:
start_dates_deposits.idxmax() #returns the index label corresponding to the highest value in a series

'7/4/2017'

In [10]:
start_dates_deposits.idxmin()

'7/4/2014'

In [12]:
start_dates_deposits.head() #this method provides a quick and efficient way for you to catch a glimpse of the structure of your dataset

7/4/2014    2000
7/4/2015    2000
7/4/2016    2200
7/4/2017    4000
7/4/2019    2000
dtype: int64

In [13]:
start_dates_deposits.tail()

7/4/2014    2000
7/4/2015    2000
7/4/2016    2200
7/4/2017    4000
7/4/2019    2000
dtype: int64

### Parameters and Arguments in Pandas

- **Pandas methods** often come with parameters that you can supply with **arguments** to modify how the method operates.
- A **parameter** in a Python method or function always **has a name**, allowing you to customize the behavior of the method.
- It is considered **good practice** to refer to parameters by using their names explicitly, ensuring you provide them in the correct order. This makes the code more readable and avoids errors. 

By using named parameters, you can also provide arguments in any order, which is helpful when dealing with methods that have many optional parameters.

In [14]:
start_dates_deposits = pd.Series({
    '7/4/2014' : 2000,
    '7/4/2015' : 2000,
    '7/4/2016' : 2200,
    '7/4/2017' : 4000,
    '7/4/2019' : 2000 })

In [17]:
start_dates_deposits.head(2) #this method provides us with the option to choose the number of displayed rows from the object it has been applied to
#the default of that parameter is 5

7/4/2014    2000
7/4/2015    2000
dtype: int64

In [18]:
start_dates_deposits.head(n = 2)

7/4/2014    2000
7/4/2015    2000
dtype: int64

### Using `.unique()` and `.nunique()`

- **`.unique()`**: Returns all the unique values in the array or column. The output will be in the order the values first appear in the dataset.
  
- **`.nunique()`**: Returns the number of unique values in the array or column. This is useful for quickly checking how many distinct values there are.

In [22]:
data = pd.read_csv('C:/Users/user/Desktop/online courses/python/Location.csv')
location_data = data.copy()
location_data = location_data['Location']
location_data.head()

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [23]:
type(location_data)

pandas.core.series.Series

In [24]:
location_data.describe()

count            1043
unique            296
top       Location 25
freq               31
Name: Location, dtype: object

the <b>top</b> is the most frequent values, and the <b>freq</b> is it's frequancy

In [25]:
len(location_data)

1043

In [26]:
location_data.nunique() #number of unique values

296

In [29]:
type(location_data.nunique())

int

In [27]:
location_data.unique() #get all 296 unique values in the array

array(['Location 3', 'Location 6', 'Location 8', 'Location 26',
       'Location 34', 'Location 25', 'Location 46', 'Location 156',
       'Location 21', 'Location 13', 'Location 579', 'Location 602',
       'Location 10', 'Location 44', 'Location 30', 'Location 48',
       'Location 196', 'Location 64', 'Location 91', 'Location 62',
       'Location 75', 'Location 42', 'Location 233', 'Location 95',
       'Location 78', 'Location 61', 'Location 87', 'Location 19',
       'Location 115', 'Location 350', 'Location 377', 'Location 17',
       'Location 113', 'Location 81', 'Location 58', 'Location 212',
       'Location 53', 'Location 337', 'Location 41', 'Location 632',
       'Location 73', 'Location 214', 'Location 218', 'Location 38',
       'Location 172', 'Location 197', 'Location 101', 'Location 185',
       'Location 129', 'Location 235', 'Location 142', 'Location 50',
       'Location 76', 'Location 11', 'Location 33', 'Location 22',
       'Location 145', 'Location 203', 'Location 94', 'Location 573',
       'Location 27', 'Location 186', 'Location 4', 'Location 70',
       'Location 45', 'Location 262', 'Location 111', 'Location 84',
       'Location 108', 'Location 7', 'Location 74', 'Location 450',
       'Location 47', 'Location 37', 'Location 43', 'Location 286',
       'Location 89', 'Location 24', 'Location 97', 'Location 144',
       'Location 40', 'Location 128', 'Location 169', 'Location 399',
       'Location 23', 'Location 191', 'Location 178', 'Location 510',
       'Location 600', 'Location 188', 'Location 67', 'Location 49',
       'Location 29', 'Location 222', 'Location 386', 'Location 88',
       'Location 104', 'Location 405', 'Location 114', 'Location 259',
       'Location 182', 'Location 12', 'Location 228', 'Location 149',
       'Location 90', 'Location 109', 'Location 441', 'Location 421',
       'Location 641', 'Location 195', 'Location 20', 'Location 161',
       'Location 117', 'Location 200', 'Location 106', 'Location 31',
       'Location 122', 'Location 541', 'Location 495', 'Location 193',
       'Location 39', 'Location 9', 'Location 86', 'Location 107',
       'Location 198', 'Location 318', 'Location 135', 'Location 177',
       'Location 32', 'Location 591', 'Location 488', 'Location 418',
       'Location 587', 'Location 454', 'Location 543', 'Location 489',
       'Location 60', 'Location 52', 'Location 548', 'Location 15',
       'Location 240', 'Location 658', 'Location 209', 'Location 151',
       'Location 192', 'Location 364', 'Location 18', 'Location 503',
       'Location 482', 'Location 460', 'Location 71', 'Location 69',
       'Location 258', 'Location 204', 'Location 124', 'Location 168',
       'Location 35', 'Location 296', 'Location 136', 'Location 28',
       'Location 153', 'Location 99', 'Location 132', 'Location 427',
       'Location 118', 'Location 127', 'Location 159', 'Location 154',
       'Location 175', 'Location 120', 'Location 82', 'Location 152',
       'Location 56', 'Location 282', 'Location 566', 'Location 365',
       'Location 353', 'Location 66', 'Location 2', 'Location 323',
       'Location 473', 'Location 206', 'Location 57', 'Location 68',
       'Location 166', 'Location 1', 'Location 227', 'Location 79',
       'Location 642', 'Location 105', 'Location 644', 'Location 547',
       'Location 637', 'Location 59', 'Location 574', 'Location 529',
       'Location 554', 'Location 275', 'Location 589', 'Location 160',
       'Location 410', 'Location 146', 'Location 221', 'Location 265',
       'Location 569', 'Location 157', 'Location 648', 'Location 165',
       'Location 651', 'Location 266', 'Location 77', 'Location 158',
       'Location 336', 'Location 72', 'Location 463', 'Location 253',
       'Location 5', 'Location 431', 'Location 515', 'Location 226',
       'Location 140', 'Location 110', 'Location 202', 'Location 634',
       'Location 138', 'Location 217', 'Location 443', 'Location 627',
       'Location 123', 'Location 528', 'Location 357', 'Location 187',
       'Location 315', 'Location 112', 'Location 302', 'Location 194',
       'Location 332', 'Location 208', 'Location 179', 'Location 199',
       'Location 201', 'Location 174', 'Location 474', 'Location 184',
       'Location 63', 'Location 512', 'Location 403', 'Location 436',
       'Location 210', 'Location 468', 'Location 464', 'Location 98',
       'Location 102', 'Location 325', 'Location 267', 'Location 173',
       'Location 617', 'Location 141', 'Location 300', 'Location 216',
       'Location 506', 'Location 647', 'Location 402', 'Location 239',
       'Location 54', 'Location 137', 'Location 477', 'Location 586',
       'Location 472', 'Location 374', 'Location 458', 'Location 180',
       'Location 653', 'Location 16', 'Location 612', 'Location 505',
       'Location 631', 'Location 299', 'Location 65', 'Location 342',
       'Location 155', 'Location 511', 'Location 461', 'Location 244',
       'Location 207', 'Location 597', 'Location 352', 'Location 533',
       'Location 384', 'Location 80', 'Location 171', 'Location 143',
       'Location 576', 'Location 139', 'Location 125', 'Location 181'],
      dtype=object)

In [28]:
type(location_data.unique())

numpy.ndarray

### Using `.sort_values()`

- **`.sort_values()`**: Sorts the values of a column or series. By default, it sorts the values in **ascending order**.

- To sort in **descending order**, use the argument `ascending=False`:  
  `data.sort_values(ascending=False)`

- For **non-numeric values**, the sorting will be done **alphabetically**.

In [30]:
#sorting using only one column
numbers = pd.Series([15,1000,23,45,444])
numbers

0      15
1    1000
2      23
3      45
4     444
dtype: int64

In [31]:
numbers.sort_values()

0      15
2      23
3      45
4     444
1    1000
dtype: int64

In [32]:
numbers.sort_values(ascending = False)

1    1000
4     444
3      45
2      23
0      15
dtype: int64

In [42]:
data = pd.read_csv('C:/Users/user/Desktop/online courses/python/Location.csv')
location_data = data.copy()
location_data = location_data['Location']
location_data.head()

0     Location 3
1     Location 6
2     Location 8
3    Location 26
4    Location 34
Name: Location, dtype: object

In [43]:
location_data.sort_values()

637     Location 1
884     Location 1
465     Location 1
716    Location 10
623    Location 10
          ...
482    Location 97
128    Location 97
669    Location 97
757    Location 98
372    Location 99
Name: Location, Length: 1043, dtype: object

### Pandas DataFrame

- A **DataFrame** is a **two-dimensional** table with **rows** and **columns**, similar to a table in SQL or an Excel sheet.
- Each **column** in a DataFrame is a **Series**, meaning it is a one-dimensional data structure that can store multiple data types.
- A DataFrame can store **heterogeneous** data, meaning the columns can hold different data types (e.g., integers, floats, strings).
- Maintaining **data consistency** is important, and each column should ideally store data of the same type.
  
**Reference points in a DataFrame**:
- **Column of interest**: The specific column you are working with.
- **Relevant row**: The specific row within the DataFrame where data is located.

In [44]:
import numpy as np

In [45]:
array_a = np.array([[3,2,1], [6,3,2]])
array_a

array([[3, 2, 1],
       [6, 3, 2]])

In [49]:
pd.DataFrame(array_a)

   0  1  2
0  3  2  1
1  6  3  2

In [50]:
type(pd.DataFrame(array_a))

pandas.core.frame.DataFrame

In [53]:
df = pd.DataFrame(array_a, columns = ['column 1', 'column 2', 'column 3'], index = ['row 1', 'row 2'])
df

       column 1  column 2  column 3
row 1         3         2         1
row 2         6         3         2

## Common Attributes for Working with DataFrames

In [66]:
data = pd.read_csv("C:/Users/user/Desktop/online courses/python/Lending-company.csv", index_col = 'LoanID')
lending_data = data.copy()
lending_data.head()

,StringID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
LoanID,,,,,,,,,,,,,,
1,LoanID_1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
2,LoanID_2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
3,LoanID_3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
4,LoanID_4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
5,LoanID_5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [67]:
lending_data.index #get the index

Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
       ...
       1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
      dtype='int64', name='LoanID', length=1043)

In [68]:
lending_data.columns #get column names

Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
       'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
       'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
      dtype='object')

In [70]:
lending_data.axes #get the indexes and the column names

[Index([   1,    2,    3,    4,    5,    6,    7,    8,    9,   10,
        ...
        1034, 1035, 1036, 1037, 1038, 1039, 1040, 1041, 1042, 1043],
       dtype='int64', name='LoanID', length=1043),
 Index(['StringID', 'Product', 'CustomerGender', 'Location', 'Region',
        'TotalPrice', 'StartDate', 'Deposit', 'DailyRate', 'TotalDaysYr',
        'AmtPaid36', 'AmtPaid60', 'AmtPaid360', 'LoanStatus'],
       dtype='object')]

In [72]:
lending_data.dtypes #this important because keeping track of data consistency is a main goal for a data analyst

StringID           object
Product            object
CustomerGender     object
Location           object
Region             object
TotalPrice        float64
StartDate          object
Deposit             int64
DailyRate           int64
TotalDaysYr         int64
AmtPaid36           int64
AmtPaid60           int64
AmtPaid360          int64
LoanStatus         object
dtype: object

In [74]:
lending_data.values #deliver two dimensional numpy array representaion of the values of the object

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [75]:
lending_data.to_numpy() #this method convert dataframe into a numpy array

array([['LoanID_1', 'Product B', 'Female', ..., 4166, 14621, 'Active'],
       ['LoanID_2', 'Product D', 'Female', ..., 4096, 16041, 'Active'],
       ['LoanID_3', 'Product B', 'Male', ..., 3205, 16340, nan],
       ...,
       ['LoanID_1041', 'Product A', 'NotSpecified', ..., 5143, 16617,
        'Finished Payment'],
       ['LoanID_1042', 'Product B', 'Female', ..., 3462, 15617,
        'Finished Payment'],
       ['LoanID_1043', 'Product A', 'NotSpecified', ..., 4743, 16617,
        'Finished Payment']], dtype=object)

In [76]:
lending_data.shape #get the dimensions of the object (rows,columns)

(1043, 14)

In [77]:
len(lending_data.columns)

14

### Data Selection in Pandas DataFrames

**Data selection** or **subset selection** refers to extracting specific elements, rows, columns, or subsets of data from a DataFrame to work with a smaller portion of the dataset.

### Indexing:
- In Pandas, data selection is typically performed using **indexes**: row index and column index. These allow us to access or select particular parts of the data efficiently.

   - You can select columns by referencing the column name.
   - Example: `df['column_name']` â†’ Returns the data of the specified column.

In [79]:
data = pd.read_csv("C:/Users/user/Desktop/online courses/python/Lending-company.csv", index_col = 'StringID')
lending_data = data.copy()
lending_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [80]:
lending_data.Product #get the values of the product column

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [82]:
lending_data['Location'] #better use this one because sometimes we have column name with two words and a space

StringID
LoanID_1        Location 3
LoanID_2        Location 6
LoanID_3        Location 8
LoanID_4       Location 26
LoanID_5       Location 34
                  ...
LoanID_1039    Location 73
LoanID_1040    Location 82
LoanID_1041    Location 11
LoanID_1042    Location 26
LoanID_1043    Location 94
Name: Location, Length: 1043, dtype: object

In [83]:
type(lending_data['Location'])

pandas.core.series.Series

In [92]:
type(lending_data[['Location']]) #nested list containing a single element
#nesting a list within the indexing operator is most needed when we want to extract data from several columns

pandas.core.frame.DataFrame

In [94]:
prod_loc = lending_data[['Location', 'Product']]
prod_loc.head()

             Location    Product
StringID
LoanID_1   Location 3  Product B
LoanID_2   Location 6  Product D
LoanID_3   Location 8  Product B
LoanID_4  Location 26  Product A
LoanID_5  Location 34  Product B

### Indexing with `.iloc[]` (Integer Location)

- **`.iloc[]`** is an indexer or **attribute accessor** used for position-based indexing.
- It allows **strict implicit**, **integer-location**, and **position-based indexing**, which means you access elements based on their row and column positions (integer indices).
- Use `.iloc[]` when you want to index by integers rather than labels.

### Syntax: 
- The syntax for `.iloc[]` is as follows:
  ```python
  df.iloc[row_indexer, col_indexer]
  ```

### Key Points:
- **Row Indexer:** Specifies the position of the row (integer).
- **Column Indexer:** Specifies the position of the column (integer).

### Examples:
1. **Selecting a Single Data Point:**
   - When you specify both row and column index, you can get a **single data point**.
   - Example: 
     ```python
     df.iloc[0, 1]  # Get the value at the first row, second column
     ```
   - The result will be in the form of a **scalar value** (data point).

2. **Selecting Multiple Rows and Columns:**
   - When you use slices or lists of integers, you'll get a **DataFrame**.
   - Example:
     ```python
     df.iloc[0:3, 1:4]  # Get rows 0-2 and columns 1-3
     ```
   - This will return a subset of the DataFrame with the selected rows and columns.

3. **Selecting All Rows or Columns:**
   - To select all rows or columns, you can use a colon (`:`) in the indexer.
   - Example:
     ```python
     df.iloc[:, 2]  # Select all rows, but only the third column
     df.iloc[1:4, :]  # Select rows 1-3, all columns
     ```

4. **Using Lists of Integer Indices:**
   - You can use lists to specify multiple rows or columns.
   - Example:
     ```python
     df.iloc[[0, 2, 4], [1, 3]]  # Select specific rows and columns
     ```

In [95]:
data = pd.read_csv("C:/Users/user/Desktop/online courses/python/Lending-company.csv", index_col = 'StringID')
lending_co_data = data.copy()
lending_co_data.head()

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_1,1,Product B,Female,Location 3,Region 2,17600.0,04/07/2018,2200,45,365,3221,4166,14621,Active
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_3,3,Product B,Male,Location 8,Region 3,16600.0,08/12/2016,1000,45,365,2260,3205,16340,NaN
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active
LoanID_5,5,Product B,Female,Location 34,Region 3,21250.0,28/10/2017,2200,55,365,3570,4745,14720,Active

In [97]:
lending_co_data.iloc[1] #row specifier

LoanID                     2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: LoanID_2, dtype: object

In [98]:
lending_co_data.iloc[1,3]

'Location 6'

In [99]:
lending_co_data.iloc[1,:] #the first row all columns

LoanID                     2
Product            Product D
CustomerGender        Female
Location          Location 6
Region              Region 6
TotalPrice               NaN
StartDate         02/01/2019
Deposit                 2200
DailyRate                 45
TotalDaysYr              365
AmtPaid36               3161
AmtPaid60               4096
AmtPaid360             16041
LoanStatus            Active
Name: LoanID_2, dtype: object

In [101]:
lending_co_data.iloc[:,1] #the first column all rows

StringID
LoanID_1       Product B
LoanID_2       Product D
LoanID_3       Product B
LoanID_4       Product A
LoanID_5       Product B
                 ...
LoanID_1039    Product B
LoanID_1040    Product A
LoanID_1041    Product A
LoanID_1042    Product B
LoanID_1043    Product A
Name: Product, Length: 1043, dtype: object

In [103]:
lending_co_data.iloc[[1,3],:] #the second and fourth rows and all columns

,LoanID,Product,CustomerGender,Location,Region,TotalPrice,StartDate,Deposit,DailyRate,TotalDaysYr,AmtPaid36,AmtPaid60,AmtPaid360,LoanStatus
StringID,,,,,,,,,,,,,,
LoanID_2,2,Product D,Female,Location 6,Region 6,NaN,02/01/2019,2200,45,365,3161,4096,16041,Active
LoanID_4,4,Product A,Male,Location 26,Region 2,17600.0,NaN,2200,45,365,3141,4166,16321,Active

In [105]:
lending_co_data.iloc[:,[1,3]] #the second and fourth columns and all rows

               Product     Location
StringID
LoanID_1     Product B   Location 3
LoanID_2     Product D   Location 6
LoanID_3     Product B   Location 8
LoanID_4     Product A  Location 26
LoanID_5     Product B  Location 34
...                ...          ...
LoanID_1039  Product B  Location 73
LoanID_1040  Product A  Location 82
LoanID_1041  Product A  Location 11
LoanID_1042  Product B  Location 26
LoanID_1043  Product A  Location 94

[1043 rows x 2 columns]

### `.loc[]` Indexer

- The `.loc[]` indexer allows you to **sub-select** information from a DataFrame by referring to its **index labels** and **column labels**.
- It has been specifically designed to take advantage of the **explicit index** and **column labels** present in the DataFrame.
  
### Key Features of `.loc[]`:
- **Label-based indexing**: Works with the **labels** (names) of rows and columns, not integer positions.
- It can be used to select both **single values**, **rows**, **columns**, or **subsets of DataFrame**.

### Syntax:
```python
df.loc[row_label, column_label]
```

### Key Points:
- **Row Label**: Refers to the index label of the row.
- **Column Label**: Refers to the label of the column you want to select.

### Examples:
1. **Selecting a Single Data Point**:
   - When you specify both row and column labels, you can select a **single data point**.
   - Example: 
     ```python
     df.loc['row1', 'column1']  # Get the value in row 'row1' and column 'column1'
     ```

2. **Selecting Entire Rows or Columns**:
   - You can select entire rows or columns by specifying just one label.
   - Example: 
     ```python
     df.loc['row1']  # Select the entire row with label 'row1'
     df.loc[:, 'column1']  # Select the entire column with label 'column1'
     ```

3. **Selecting Multiple Rows and Columns**:
   - You can also use slices or lists to select multiple rows and columns.
   - Example: 
     ```python
     df.loc['row1':'row3', 'column1':'column3']  # Select a range of rows and columns
     df.loc[['row1', 'row2'], ['column1', 'column2']]  # Select specific rows and columns
     ```

4. **Selecting Rows or Columns with Conditions**:
   - `.loc[]` can also be used with **boolean conditions** to filter data.
   - Example:
     ```python
     df.loc[df['column1'] > 10]  # Select rows where the value in 'column1' is greater than 10
     ```

In [107]:
lending_co_data.loc['LoanID_3',:] #third row

LoanID                     3
Product            Product B
CustomerGender          Male
Location          Location 8
Region              Region 3
TotalPrice           16600.0
StartDate         08/12/2016
Deposit                 1000
DailyRate                 45
TotalDaysYr              365
AmtPaid36               2260
AmtPaid60               3205
AmtPaid360             16340
LoanStatus               NaN
Name: LoanID_3, dtype: object

In [110]:
lending_co_data.loc[:,['Location']] #get the column location

                Location
StringID
LoanID_1      Location 3
LoanID_2      Location 6
LoanID_3      Location 8
LoanID_4     Location 26
LoanID_5     Location 34
...                  ...
LoanID_1039  Location 73
LoanID_1040  Location 82
LoanID_1041  Location 11
LoanID_1042  Location 26
LoanID_1043  Location 94

[1043 rows x 1 columns]